Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения,
		СтандартнаяОбработка)

	Если (ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Состав") = Истина) Тогда
		Состав.Загрузить(ДанныеЗаполнения.Состав);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Условие = Новый Структура("Клиент", Клиент);

	Если (ПолучитьФункциональнуюОпцию("Резервирование", Условие) = Ложь) Тогда
		Состав.ЗагрузитьКолонку(Новый Массив(Состав.Количество()), "Отложить");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьКолонкуЦена() Экспорт
	Сообщить("Метод: ЗаполнитьКолонкуЦену отработал");
КонецПроцедуры


