Процедура СоздатьЗаказ(Ответ, Параметры) Экспорт
	
	Перем ПараметрыФормы;
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		ИсходныеДанные = Новый Структура("Клиент, Состав");
		ИсходныеДанные.Клиент = ТекущийКлиент();
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ИсходныеДанные);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта", ПараметрыФормы)
	
КонецПроцедуры

Функция ТекущийКлиент()
	
	Перем ОкноНачальнойСтраницы;
	Перем ФормаОбластиКлиенты;
	
	ВсеОкна = ПолучитьОкна();
	
	Для Каждого Окно Из ВсеОкна Цикл
		
		Если (Окно.НачальнаяСтраница = Истина) Тогда
			ОкноНачальнойСтраницы = Окно;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Форма Из ОкноНачальнойСтраницы.Содержимое Цикл
		
		Если (Форма.ИмяФормы = "ОбщаяФорма.Область_Клиенты") Тогда
			ФормаОбластиКлиенты = Форма;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если (ФормаОбластиКлиенты = Неопределено) Тогда
		Значение = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");
	Иначе
		Значение = ФормаОбластиКлиенты.Элементы.Список.ТекущаяСтрока;
		Если (Значение = Неопределено) Тогда
			Значение = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;  
	
КонецФункции