Функция Профиль() Экспорт

	Если ПрофильЕсть() = Ложь Тогда

		Справочники.ПрофилиПользователей.Добавить();

	КонецЕсли;

	Идентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;

	Возврат Справочники.ПрофилиПользователей.ПолучитьСсылку(Идентификатор);

КонецФункции

Функция ПрофильЕсть()

	Идентификатор = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;

	Ссылка = Справочники.ПрофилиПользователей.ПолучитьСсылку(Идентификатор);

	Возврат ЗначениеЗаполнено(СокрЛП(Ссылка.ВерсияДанных))
КонецФункции

