&НаКлиенте
Процедура СоставПередОкончаниемРедактирования(Элемент, НоваяСтрока,
		ОтменаРедактирования, Отказ)

	ДанныеСтроки = Элементы.Состав.ТекущиеДанные;

	Если (НоваяСтрока = Истина) Тогда
		ВыполнитьРасчетСуммыСтроки(ДанныеСтроки);
	Иначе

		Если (ДанныеСтроки.Цена <> СтарыеДанныеСтроки.Цена
				или ДанныеСтроки.Количество <> СтарыеДанныеСтроки.Количество) Тогда
			ВыполнитьРасчетСуммыСтроки(ДанныеСтроки);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
	ЗаполнитьЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()

	ДокОбъект = РеквизитФормыВЗначение("Объект");

	ДокОбъект.ЗаполнитьКолонкуЦена();

	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура СоставСуммаСтрокиПриИзменении(Элемент)
	ДанныеСтроки = Элементы.Состав.ТекущиеДанные;

	Если (ДанныеСтроки.Количество = 0) Тогда
		ДанныеСтроки.Цена = ДанныеСтроки.СуммаСтроки;
	Иначе
		ДанныеСтроки.Цена = ДанныеСтроки.СуммаСтроки / ДанныеСтроки.Количество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПередНачаломИзменения(Элемент, Отказ)

	СтарыеДанныеСтроки = Новый Структура("Цена, Количество");

	ЗаполнитьЗначенияСвойств(СтарыеДанныеСтроки, Элементы.Состав.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРасчетСуммыСтроки(ДанныеСтроки)
	ДанныеСтроки.СуммаСтроки = ДанныеСтроки.Цена * ДанныеСтроки.Количество;
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьКарточкуРезервирования(Команда)
//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьПараметрыОпций(Новый Структура("Клиент,ПрофильПользователя, Период", Объект.Клиент, Пользователь.Профиль(), Объект.Дата));
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)

	ОбновитьПараметрыОпций(Новый Структура("Клиент, ПрофильПользователя", Объект.Клиент, Пользователь.Профиль()));

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	ОбновитьПараметрыОпций(Новый Структура("Период", Объект.Дата));

КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыОпций(УстанавливаемыеПараметры)
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавливаемыеПараметры);
КонецПроцедуры


